In [3]:
!pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /opt/conda/lib/python3.8/site-packages (2.8.6)

In [4]:
try:
    from faker import Faker
except:
   !pip install faker 
   from faker import Faker
    
try:
    import psycopg2 
except:
    !pip install psycopg2-binary 
    import psycopg2
    
try:
    from sqlalchemy import create_engine
except:
    !pip install sqlalchemy
    from sqlalchemy import create_engine
    
    
try:
    import pandas as pd 
except:
    !pip install pandas
    import pandas as pd

In [5]:
from sqlalchemy import create_engine
import psycopg2

host="postgres_data" # use "localhost" if you access from outside the localnet docker-compose env 
database="testDB"
user="me"
password="1234"
port='5432'
engine = create_engine(f'postgresql://{user}:{password}@{host}:{port}/{database}')
print(engine.table_names())

[]

<ipython-input-5-8b9b9557a8b0>:10: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  print(engine.table_names())

In [7]:
from faker import Faker
import csv
import pandas as pd 
output=open('data.csv','w')
fake=Faker()
header=['name','age','street','city','state','zip','lng','lat']
mywriter=csv.writer(output)
mywriter.writerow(header)
for r in range(100):
    row =[fake.name(),fake.random_int(min=18,max=80, step=1), 
                       fake.street_address(), fake.city(),fake.state(),
                       fake.zipcode(),fake.longitude(),fake.latitude()]
    mywriter.writerow(row)
output.close()
DF=pd.read_csv('data.csv')
DF.head(5)

,name,age,street,city,state,zip,lng,lat
0,Antonio Johnson,40,802 Justin Pass Suite 099,Samuelport,North Carolina,74108,-72.554197,-29.974500
1,John Barnes,23,2833 Lisa Harbor Apt. 364,Mitchellborough,Massachusetts,30507,-106.019903,-46.986939
2,Megan Martin,42,5379 Sherman Village Apt. 136,West Amyhaven,Virginia,87437,-8.894662,-38.265349
3,Madison Bryant,79,929 Perry Keys Apt. 812,West Melindaland,Indiana,11721,-71.963429,-23.547724
4,Jennifer Ferguson,19,013 Mcdonald Summit Apt. 499,Roberttown,Oklahoma,65310,-64.004111,72.046041

In [8]:
DF.to_sql('users2020', engine, if_exists='replace',index=False)

In [9]:
DF2=pd.read_sql("SELECT * FROM users2020" , engine);

In [10]:
DF2.head(5)

,name,age,street,city,state,zip,lng,lat
0,Antonio Johnson,40,802 Justin Pass Suite 099,Samuelport,North Carolina,74108,-72.554197,-29.974500
1,John Barnes,23,2833 Lisa Harbor Apt. 364,Mitchellborough,Massachusetts,30507,-106.019903,-46.986939
2,Megan Martin,42,5379 Sherman Village Apt. 136,West Amyhaven,Virginia,87437,-8.894662,-38.265349
3,Madison Bryant,79,929 Perry Keys Apt. 812,West Melindaland,Indiana,11721,-71.963429,-23.547724
4,Jennifer Ferguson,19,013 Mcdonald Summit Apt. 499,Roberttown,Oklahoma,65310,-64.004111,72.046041

In [11]:
Count_records=pd.read_sql("SELECT COUNT(*) FROM users2020" , engine);
Count_records

   count
0    172